<?php
$text = 'Жил на свете добрый волшебник. 
Он жил в мире, где магия стояла на первом месте и практически затмила собой науку. 
А этот волшебник (звали его Зак) очень увлекался астрономией. 
И вот однажды он подумал, а не сделать ли мне собственную звезду? 
И сотворил звезду. Назвал её Солнце. 
А вокруг неё сделал несколько планет. 
А теперь он тёмными вечерами наблюдает за Солнцем и несколькими планетами. 
Пьёт чай и тихонько улыбается. 
Потому что необыкновенно красиво.';
echo $text. PHP_EOL;
echo 'Количество слов в тексте: ', count(preg_split('/\s+/u', $text, null, PREG_SPLIT_NO_EMPTY));
//echo "Жил на свете добрый волшебник. Он жил в мире, где магия стояла на первом месте и практически затмила собой науку. А этот волшебник (звали его Зак) очень увлекался астрономией. И вот однажды он подумал - а не сделать ли мне собственную звезду? И сотворил звезду. И назвал её Солнце. А вокруг неё сделал несколько планет. А теперь он тёмными вечерами наблюдает за Солнцем и несколькими планетами. Пьёт чай и тихонько улыбается. Потому что необыкновенно красиво.";